#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.google_client_config.current: Reading...
google_secret_manager_secret.secret: Refreshing state... [id=projects/poc-test-397814/secrets/jmusic-config]
data.google_project.project: Reading...
google_project_service.run_api: Refreshing state... [id=poc-test-397814/run.googleapis.com]
data.google_client_config.current: Read complete after 0s [id=projects/"poc-test-397814"/regions/"us-central1"/zones/"us-central1-c"]
google_secret_manager_secret_version.secret-version-data: Refreshing state... [id=projects/746606943466/secrets/jmusic-config/versions/2]
data.google_project.project: Read complete after 1s [id=projects/poc-test-397814]
google_secret_manager_secret_iam_member.secret-access: Refreshing state... [id=projects/poc-test-397814/secrets/jmusic-config/roles/secretmanager.secretAccessor/serviceAccount:746606943466-compute@developer.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_v2_service.run_service will be created
  + resource "google_cloud_run_v2_service" "run_service" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "jmusicbot"
      + observed_generation     = (known after apply)
      + project                 = (known after apply)
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "craumix/jmusicbot"

              + ports {
                  + container_port = 56216
                  + name           = (known after apply)
                }

              + startup_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 10
                  + period_seconds        = 3
                  + timeout_seconds       = 1

                  + tcp_socket {
                      + port = 56216
                    }
                }

              + volume_mounts {
                  + mount_path = "/jmb/config"
                  + name       = "a-volume"
                }
            }

          + volumes {
              + name = "a-volume"

              + secret {
                  + secret = "jmusic-config"

                  + items {
                      + mode    = 0
                      + path    = "config.txt"
                      + version = "latest"
                    }
                }
            }
        }
    }

  # google_cloud_run_v2_service_iam_member.run_all_users will be created
  + resource "google_cloud_run_v2_service_iam_member" "run_all_users" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + name     = "jmusicbot"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + service_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @benpngo, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Demo Plan`*